<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Short-intro-to-NumPy" data-toc-modified-id="Short-intro-to-NumPy-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Short intro to NumPy</a></span></li><li><span><a href="#Introduction-to-Pandas-Library" data-toc-modified-id="Introduction-to-Pandas-Library-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Introduction to Pandas Library</a></span><ul class="toc-item"><li><span><a href="#Key-Features-of-Pandas" data-toc-modified-id="Key-Features-of-Pandas-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Key Features of Pandas</a></span></li><li><span><a href="#DataFrames-and-Series-in-Pandas" data-toc-modified-id="DataFrames-and-Series-in-Pandas-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>DataFrames and Series in Pandas</a></span></li></ul></li><li><span><a href="#Series-in-Pandas" data-toc-modified-id="Series-in-Pandas-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Series in Pandas</a></span><ul class="toc-item"><li><span><a href="#Creating-Series" data-toc-modified-id="Creating-Series-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Creating Series</a></span><ul class="toc-item"><li><span><a href="#From-a-list" data-toc-modified-id="From-a-list-3.1.1"><span class="toc-item-num">3.1.1&nbsp;&nbsp;</span>From a list</a></span></li><li><span><a href="#From-a-list-with-index" data-toc-modified-id="From-a-list-with-index-3.1.2"><span class="toc-item-num">3.1.2&nbsp;&nbsp;</span>From a list with index</a></span></li><li><span><a href="#From-a-dictionary" data-toc-modified-id="From-a-dictionary-3.1.3"><span class="toc-item-num">3.1.3&nbsp;&nbsp;</span>From a dictionary</a></span></li><li><span><a href="#From-a-file" data-toc-modified-id="From-a-file-3.1.4"><span class="toc-item-num">3.1.4&nbsp;&nbsp;</span>From a file</a></span></li></ul></li><li><span><a href="#Data-access-in-Series" data-toc-modified-id="Data-access-in-Series-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Data access in Series</a></span></li><li><span><a href="#Methods-in-Series" data-toc-modified-id="Methods-in-Series-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Methods in Series</a></span><ul class="toc-item"><li><span><a href="#concat()" data-toc-modified-id="concat()-3.3.1"><span class="toc-item-num">3.3.1&nbsp;&nbsp;</span><code>concat()</code></a></span></li><li><span><a href="#sort_values()-and-sort_index()" data-toc-modified-id="sort_values()-and-sort_index()-3.3.2"><span class="toc-item-num">3.3.2&nbsp;&nbsp;</span><code>sort_values() and sort_index()</code></a></span></li><li><span><a href="#value_counts()" data-toc-modified-id="value_counts()-3.3.3"><span class="toc-item-num">3.3.3&nbsp;&nbsp;</span><code>value_counts()</code></a></span></li></ul></li><li><span><a href="#ðŸ’¡-Check-for-understanding" data-toc-modified-id="ðŸ’¡-Check-for-understanding-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>ðŸ’¡ Check for understanding</a></span></li></ul></li><li><span><a href="#Dataframes-in-Pandas" data-toc-modified-id="Dataframes-in-Pandas-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Dataframes in Pandas</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#head()-and-tail()" data-toc-modified-id="head()-and-tail()-4.0.1"><span class="toc-item-num">4.0.1&nbsp;&nbsp;</span><code>head()</code> and <code>tail()</code></a></span></li><li><span><a href="#index,-columns-and-values" data-toc-modified-id="index,-columns-and-values-4.0.2"><span class="toc-item-num">4.0.2&nbsp;&nbsp;</span><code>index, columns and values</code></a></span></li></ul></li><li><span><a href="#Data-access-in-Dataframe" data-toc-modified-id="Data-access-in-Dataframe-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Data access in Dataframe</a></span><ul class="toc-item"><li><span><a href="#Columns" data-toc-modified-id="Columns-4.1.1"><span class="toc-item-num">4.1.1&nbsp;&nbsp;</span>Columns</a></span></li><li><span><a href="#Rows" data-toc-modified-id="Rows-4.1.2"><span class="toc-item-num">4.1.2&nbsp;&nbsp;</span>Rows</a></span></li><li><span><a href="#Specific-values" data-toc-modified-id="Specific-values-4.1.3"><span class="toc-item-num">4.1.3&nbsp;&nbsp;</span>Specific values</a></span></li></ul></li><li><span><a href="#More-DataFrame-Methods" data-toc-modified-id="More-DataFrame-Methods-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>More DataFrame Methods</a></span><ul class="toc-item"><li><span><a href="#shape" data-toc-modified-id="shape-4.2.1"><span class="toc-item-num">4.2.1&nbsp;&nbsp;</span><code>shape</code></a></span></li><li><span><a href="#describe()" data-toc-modified-id="describe()-4.2.2"><span class="toc-item-num">4.2.2&nbsp;&nbsp;</span><code>describe()</code></a></span></li><li><span><a href="#info()" data-toc-modified-id="info()-4.2.3"><span class="toc-item-num">4.2.3&nbsp;&nbsp;</span><code>info()</code></a></span></li><li><span><a href="#nunique()-and-unique()" data-toc-modified-id="nunique()-and-unique()-4.2.4"><span class="toc-item-num">4.2.4&nbsp;&nbsp;</span><code>nunique() and unique()</code></a></span></li><li><span><a href="#dtypes" data-toc-modified-id="dtypes-4.2.5"><span class="toc-item-num">4.2.5&nbsp;&nbsp;</span><code>dtypes</code></a></span></li><li><span><a href="#select_dtypes()" data-toc-modified-id="select_dtypes()-4.2.6"><span class="toc-item-num">4.2.6&nbsp;&nbsp;</span><code>select_dtypes()</code></a></span></li><li><span><a href="#Aggregation-such-as-max()" data-toc-modified-id="Aggregation-such-as-max()-4.2.7"><span class="toc-item-num">4.2.7&nbsp;&nbsp;</span>Aggregation such as <code>max()</code></a></span></li></ul></li><li><span><a href="#ðŸ’¡-Check-for-understanding" data-toc-modified-id="ðŸ’¡-Check-for-understanding-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>ðŸ’¡ Check for understanding</a></span></li></ul></li><li><span><a href="#Summary" data-toc-modified-id="Summary-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Summary</a></span></li><li><span><a href="#Extra:-Creating-Dataframes-from-a-Dictionary" data-toc-modified-id="Extra:-Creating-Dataframes-from-a-Dictionary-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Extra: Creating Dataframes from a Dictionary</a></span></li><li><span><a href="#Extra:-pickle" data-toc-modified-id="Extra:-pickle-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Extra: pickle</a></span><ul class="toc-item"><li><span><a href="#Saving-DataFrames-with-Pickle" data-toc-modified-id="Saving-DataFrames-with-Pickle-7.1"><span class="toc-item-num">7.1&nbsp;&nbsp;</span>Saving DataFrames with Pickle</a></span></li><li><span><a href="#Loading-DataFrames-from-Pickle" data-toc-modified-id="Loading-DataFrames-from-Pickle-7.2"><span class="toc-item-num">7.2&nbsp;&nbsp;</span>Loading DataFrames from Pickle</a></span></li></ul></li></ul></div>

# Short intro to NumPy

Let's start by mentioning NumPy as Pandas builds on top of NumPy.

NumPy is a powerful library for numerical computing in Python. It provides support for large, multi-dimensional arrays and matrices, along with an extensive collection of mathematical functions to operate on these arrays efficiently.

In [1]:
import numpy as np   # as es para poner alias

In [2]:
lst1 = [1,2,3,4]

lst2 = [5,6,7,8]


lst1 + lst2

[1, 2, 3, 4, 5, 6, 7, 8]

In [3]:
arr = np.array(lst1)  # array es un vector

arr

array([1, 2, 3, 4])

In [4]:
arr2 = np.array(lst2)

arr2

array([5, 6, 7, 8])

In [5]:
arr + arr2

array([ 6,  8, 10, 12])

In [7]:
np.array([1,2,3,4]) + np.array([7,8,9])

ValueError: operands could not be broadcast together with shapes (4,) (3,)

In [8]:
np.array(['hola', 'adios']) + np.array(['sasa', 'njigd'])

UFuncTypeError: ufunc 'add' did not contain a loop with signature matching types (dtype('<U5'), dtype('<U5')) -> None

In [9]:
np.array(['hola', 'adios'])

array(['hola', 'adios'], dtype='<U5')

In [11]:
2 * arr

array([2, 4, 6, 8])

In [13]:
#help(np)

In [16]:
arr.mean()   # media

2.5

In [17]:
arr.std()    # desviacion standard

1.118033988749895

In [18]:
arr.max()

4

In [20]:
arr * arr2

array([ 5, 12, 21, 32])

# Introduction to Pandas Library

`pandas` is a powerful library designed for working with tabulated and tagged data, making it ideal for handling spreadsheets, SQL tables, and more. It revolves around two main data structures: `Series` and `DataFrames`.

## Key Features of Pandas

- Robust data import/export: `pandas` provides efficient tools to read and write data from various file formats like CSV, XLS, SQL, and HDF5.
- Data manipulation: With `pandas`, you can easily filter, add, or delete data, enabling seamless data processing.
- High-performance and versatility: It combines the performance of `numpy` arrays with the ability to handle tabulated data efficiently.

To import the necessary modules from the `pandas` library, we use the following syntax:

In [21]:
%ls

2.1_pandas.ipynb
2.2_cleaning_and_data_manipulation.ipynb
2.3_combining_structuring_data.ipynb
2.4_aggregating_data.ipynb*
2.5_apis.ipynb
2.6_web_scraping.ipynb

In [ ]:
%pip install pandas   # con esto se instala un paquete

In [22]:
import pandas as pd   # con esto se importa un paquete

![](https://github.com/data-bootcamp-v4/lessons/blob/main/img/pandas.svg?raw=true)

## DataFrames and Series in Pandas

In `pandas`, a `Series` is a one-dimensional array of data with associated labels called the *index*. If no index is specified, it generates an ordered sequence of integers.

```python
# Creating a Series
s = pd.Series(data, index=index)
```

On the other hand, a `DataFrame` is a two-dimensional data structure that stores data in tabular form, with labeled rows and columns. Each row represents an observation, and each column represents a variable. `DataFrame` can handle heterogeneous data with different types (numeric, string, boolean, etc.). It also includes variable names, types, and methods to access and modify the data.

```python
# Creating a DataFrame
df = pd.DataFrame(data, ...)
```

---
# Series in Pandas

## Creating Series

### From a list

Create a Series with default indexes from a list

In [24]:
lst1

[1, 2, 3, 4]

In [25]:
type(lst1)

list

In [26]:
serie = pd.Series(lst1)

serie

0    1
1    2
2    3
3    4
dtype: int64

In [27]:
type(serie)

pandas.core.series.Series

In [29]:
#help(serie)

The `Series` have two attributes:` values` and `index`. The first is a `numpy array` that stores the data, and the second is an object that contains the indexes.

In [30]:
serie.values

array([1, 2, 3, 4])

In [31]:
serie.index

RangeIndex(start=0, stop=4, step=1)

In [32]:
serie.index = ['a', 'b', 'c', 'd']

In [33]:
serie

a    1
b    2
c    3
d    4
dtype: int64

In [34]:
serie.index = [i for i in range(len(serie))]

serie

0    1
1    2
2    3
3    4
dtype: int64

In Pandas, `Series.items()` is a method used to iterate over the elements of a Pandas Series. It returns an iterator that yields the index-label and corresponding value pairs of the Series.

In [36]:
list(serie.items())

[(0, 1), (1, 2), (2, 3), (3, 4)]

In [37]:
dict(serie.items())

{0: 1, 1: 2, 2: 3, 3: 4}

### From a list with index

When creating a `Series`, you can explicitly define an `array` index and pass it as an argument.


Creating series with defined indexes

In [38]:
serie = pd.Series(lst1, index=['a', 'b', 'c', 'd'])

serie

a    1
b    2
c    3
d    4
dtype: int64

### From a dictionary

In [39]:
dictio = {'a': 1, 'b': 50, 'c': 200}


pd.Series(dictio)

a      1
b     50
c    200
dtype: int64

### From a file

`read_csv()` is a Pandas function used to read data from a CSV file and create a DataFrame.

When assigning one column in the parameter `usecols` and then calling the method `squeeze("columns")`, the resulst is a Series instead of a Dataframe

In [44]:
# Load Titanic dataset from an online source
url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/titanic_train.csv'

titanic_serie = pd.read_csv(url, usecols=['Name']).squeeze('columns')

type(titanic_serie)

pandas.core.series.Series

In [45]:
titanic_serie

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object



---
## Data access in Series

Data access in Pandas can be achieved through either the categorical index or the internally generated numerical index.

In [46]:
serie

a    1
b    2
c    3
d    4
dtype: int64

In [47]:
serie[0]   # por posicion

1

In [48]:
serie['a']   # por nombre

1

In [49]:
serie[0:4:2]   # sliciing

a    1
c    3
dtype: int64

In [50]:
serie[::-1]

d    4
c    3
b    2
a    1
dtype: int64



---
## Methods in Series

### `concat()`

`concat()` is a pandas function used to concatenate and combine DataFrames along a specified axis, either vertically (rows) or horizontally (columns).

In [51]:
serie

a    1
b    2
c    3
d    4
dtype: int64

In [53]:
con = pd.concat([serie, serie])

con

a    1
b    2
c    3
d    4
a    1
b    2
c    3
d    4
dtype: int64

In [54]:
con['a']

a    1
a    1
dtype: int64

In [55]:
con[0]

1

In [56]:
con = pd.concat([serie, serie], ignore_index=True)

con

0    1
1    2
2    3
3    4
4    1
5    2
6    3
7    4
dtype: int64

In [57]:
con['a']

KeyError: 'a'

In [58]:
con[1:6:3]

1    2
4    1
dtype: int64

By default `concat` keeps the original indexes. It does not restart the index by default, unless we specify `ignore_index=True`.

### `sort_values() and sort_index()`

`sort_values()` is a pandas DataFrame method that sorts the DataFrame based on specified column(s), while `sort_index()` sorts the DataFrame based on its index labels.

In [59]:
titanic_serie

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [60]:
titanic_serie.sort_values()

845                      Abbing, Mr. Anthony
746              Abbott, Mr. Rossmore Edward
279         Abbott, Mrs. Stanton (Rosa Hunt)
308                      Abelson, Mr. Samuel
874    Abelson, Mrs. Samuel (Hannah Wizosky)
                       ...
286                  de Mulder, Mr. Theodore
282                de Pelsmaeker, Mr. Alfons
361                del Carlo, Mr. Sebastiano
153          van Billiard, Mr. Austin Blyler
868              van Melkebeke, Mr. Philemon
Name: Name, Length: 891, dtype: object

In [61]:
titanic_serie.sort_values(ascending=False)  # ascendente/descendente

868              van Melkebeke, Mr. Philemon
153          van Billiard, Mr. Austin Blyler
361                del Carlo, Mr. Sebastiano
282                de Pelsmaeker, Mr. Alfons
286                  de Mulder, Mr. Theodore
                       ...
874    Abelson, Mrs. Samuel (Hannah Wizosky)
308                      Abelson, Mr. Samuel
279         Abbott, Mrs. Stanton (Rosa Hunt)
746              Abbott, Mr. Rossmore Edward
845                      Abbing, Mr. Anthony
Name: Name, Length: 891, dtype: object

In [62]:
titanic_serie.sort_values(ascending=True)

845                      Abbing, Mr. Anthony
746              Abbott, Mr. Rossmore Edward
279         Abbott, Mrs. Stanton (Rosa Hunt)
308                      Abelson, Mr. Samuel
874    Abelson, Mrs. Samuel (Hannah Wizosky)
                       ...
286                  de Mulder, Mr. Theodore
282                de Pelsmaeker, Mr. Alfons
361                del Carlo, Mr. Sebastiano
153          van Billiard, Mr. Austin Blyler
868              van Melkebeke, Mr. Philemon
Name: Name, Length: 891, dtype: object

Sort index or sort values does not change the series.
We can either save it again in the variable or we can use a paremeter
called **inplace**.

In [65]:
#help(titanic_serie.sort_values)

In [67]:
titanic_serie = titanic_serie.sort_values()  # sobreescribir la variable

titanic_serie

845                      Abbing, Mr. Anthony
746              Abbott, Mr. Rossmore Edward
279         Abbott, Mrs. Stanton (Rosa Hunt)
308                      Abelson, Mr. Samuel
874    Abelson, Mrs. Samuel (Hannah Wizosky)
                       ...
286                  de Mulder, Mr. Theodore
282                de Pelsmaeker, Mr. Alfons
361                del Carlo, Mr. Sebastiano
153          van Billiard, Mr. Austin Blyler
868              van Melkebeke, Mr. Philemon
Name: Name, Length: 891, dtype: object

In [68]:
titanic_serie.sort_values(ascending=False, inplace=True)  # inplace=True sobreescribe

In [69]:
titanic_serie

868              van Melkebeke, Mr. Philemon
153          van Billiard, Mr. Austin Blyler
361                del Carlo, Mr. Sebastiano
282                de Pelsmaeker, Mr. Alfons
286                  de Mulder, Mr. Theodore
                       ...
874    Abelson, Mrs. Samuel (Hannah Wizosky)
308                      Abelson, Mr. Samuel
279         Abbott, Mrs. Stanton (Rosa Hunt)
746              Abbott, Mr. Rossmore Edward
845                      Abbing, Mr. Anthony
Name: Name, Length: 891, dtype: object

In [70]:
serie.shape   # dimesion

(4,)

In [74]:
serie.shape[0]   # nÂº de filas

4

In [71]:
len(serie)

4

In [72]:
for valor in range(len(serie)):
    
    print(valor) # NO

0
1
2
3

In [73]:
for valor in range(serie.shape[0]):
    
    print(valor) # Esto si

0
1
2
3

In [78]:
(8)

8

In [79]:
(8,)[0]

8

### `value_counts()`

`value_counts()` is a Pandas function that returns a Series containing the counts of unique values in a Series or DataFrame.

In [80]:
con

0    1
1    2
2    3
3    4
4    1
5    2
6    3
7    4
dtype: int64

In [81]:
con.value_counts()

1    2
2    2
3    2
4    2
dtype: int64

In [84]:
titanic_serie.value_counts()[:10]

van Melkebeke, Mr. Philemon                1
Goldschmidt, Mr. George B                  1
Graham, Miss. Margaret Edith               1
Goodwin, Mrs. Frederick (Augusta Tyler)    1
Goodwin, Mr. Charles Edward                1
Goodwin, Miss. Lillian Amy                 1
Goodwin, Master. William Frederick         1
Goodwin, Master. Sidney Leonard            1
Goodwin, Master. Harold Victor             1
Goncalves, Mr. Manuel Estanslas            1
Name: Name, dtype: int64

In [85]:
titanic_serie.head()   # 5 primeros por defecto, la cabeza

868        van Melkebeke, Mr. Philemon
153    van Billiard, Mr. Austin Blyler
361          del Carlo, Mr. Sebastiano
282          de Pelsmaeker, Mr. Alfons
286            de Mulder, Mr. Theodore
Name: Name, dtype: object

In [86]:
titanic_serie.head(2)

868        van Melkebeke, Mr. Philemon
153    van Billiard, Mr. Austin Blyler
Name: Name, dtype: object

In [87]:
titanic_serie.head(11)

868                     van Melkebeke, Mr. Philemon
153                 van Billiard, Mr. Austin Blyler
361                       del Carlo, Mr. Sebastiano
282                       de Pelsmaeker, Mr. Alfons
286                         de Mulder, Mr. Theodore
559    de Messemaeker, Mrs. Guillaume Joseph (Emma)
422                              Zimmerman, Mr. Leo
240                           Zabour, Miss. Thamine
111                            Zabour, Miss. Hileni
199          Yrois, Miss. Henriette ("Mrs Harbeck")
495                           Yousseff, Mr. Gerious
Name: Name, dtype: object

In [88]:
titanic_serie.tail()    # 5 primeros por defecto, la cola

874    Abelson, Mrs. Samuel (Hannah Wizosky)
308                      Abelson, Mr. Samuel
279         Abbott, Mrs. Stanton (Rosa Hunt)
746              Abbott, Mr. Rossmore Edward
845                      Abbing, Mr. Anthony
Name: Name, dtype: object

In [89]:
titanic_serie.tail(2)

746    Abbott, Mr. Rossmore Edward
845            Abbing, Mr. Anthony
Name: Name, dtype: object


# Dataframes in Pandas

Unlike `Series`, `DataFrame` is designed to store heterogeneous multivariable data. It can be created from dictionaries (look to Extra section for examples).

We will use `read_csv` to read data from a CSV file and create a DataFrame.

We won't be using now the parameter `usecols` nor calling the method `squeeze("columns")`.

In [90]:
# Load Titanic dataset from an online source
url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/titanic_train.csv'


titanic_df = pd.read_csv(url)

### `head()` and `tail()`

The `head()` method returns the first few rows of a DataFrame or Series, while the `tail()` method returns the last few rows.

In [91]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [92]:
titanic_df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

### `index, columns and values`

The `index` attribute in Pandas returns the index labels of a DataFrame or Series, and the `columns` attribute returns the column labels of a DataFrame.

In [93]:
titanic_df.index

RangeIndex(start=0, stop=891, step=1)

`RangeIndex(start=0, stop=1460, step=1)` is a special type of index in Pandas called a `RangeIndex`. It represents a range of integer values starting from 0, up to (but not including) 1460, with a step size of 1.

In [95]:
list(titanic_df.index)[:10]

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [96]:
len(list(titanic_df.index))

891

In [97]:
titanic_df.shape   # filas x columnas

(891, 12)

In [98]:
titanic_df.shape[0]

891

In [100]:
titanic_df.shape[1]

12

In Pandas, `df.values` is an attribute that returns the underlying NumPy array of a DataFrame df. It represents the actual data stored in the DataFrame as a two-dimensional NumPy array.

In [101]:
titanic_df.values

array([[1, 0, 3, ..., 7.25, nan, 'S'],
       [2, 1, 1, ..., 71.2833, 'C85', 'C'],
       [3, 1, 3, ..., 7.925, nan, 'S'],
       ...,
       [889, 0, 3, ..., 23.45, nan, 'S'],
       [890, 1, 1, ..., 30.0, 'C148', 'C'],
       [891, 0, 3, ..., 7.75, nan, 'Q']], dtype=object)

In [102]:
titanic_df.values[0]  # primera fila en formato array

array([1, 0, 3, 'Braund, Mr. Owen Harris', 'male', 22.0, 1, 0,
       'A/5 21171', 7.25, nan, 'S'], dtype=object)

In [103]:
np.nan   # not a number

nan

In [104]:
type(np.nan)  # nulo float

float

In [105]:
type(None)   # es la nada de Bastian (historia interminable)

NoneType

In [106]:
np.inf

inf

In [107]:
type(np.inf)

float

In [108]:
'None'

'None'

In [109]:
type('None')

str


Additionally, `Pandas` can create Dataframes from other sources, such as JSON, URL ...


---
## Data access in Dataframe

### Columns

You can extract columns from a `DataFrame` using dictionary-like notation or as attributes, obtaining a `Series` object in both cases, provided the column label is a valid Python identifier.

In [123]:
titanic_df['Age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [112]:
titanic_df[0]

KeyError: 0

In [116]:
titanic_df['Age', 0]

KeyError: ('Age', 0)

In [118]:
titanic_df['Age'][0]

22.0

In [124]:
titanic_df.Age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [125]:
columnas = ['Age', 'Name']

titanic_df[columnas].head()

    Age                                               Name
0  22.0                            Braund, Mr. Owen Harris
1  38.0  Cumings, Mrs. John Bradley (Florence Briggs Th...
2  26.0                             Heikkinen, Miss. Laina
3  35.0       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4  35.0                           Allen, Mr. William Henry

In [126]:
titanic_df[['Age', 'Name']].head()

    Age                                               Name
0  22.0                            Braund, Mr. Owen Harris
1  38.0  Cumings, Mrs. John Bradley (Florence Briggs Th...
2  26.0                             Heikkinen, Miss. Laina
3  35.0       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4  35.0                           Allen, Mr. William Henry

In [131]:
type(titanic_df['Age'])

pandas.core.series.Series

In [132]:
type(titanic_df[['Age']])

pandas.core.frame.DataFrame

### Rows

To access rows in a Pandas DataFrame, you can use the `iloc` attribute with integer-based indexing or the `loc` attribute with label-based indexing. For example, `df.iloc[0]` will access the first row, and `df.loc['row_label']` will access the row with the specified label.


<div class="alert alert-info">Note: Consult http://pandas.pydata.org/pandas-docs/version/0.18.1/indexing.html#different-choices-for-indexing to understand the differences between methods.</div>

Just for the sake of this example, we will create a dictionary with a non-default index.

In [134]:
titanic_df.iloc[0]    # primera fila en formato serie

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object


**loc** is used for label-based indexing to access rows.

In [135]:
titanic_df.loc[0]    # primera fila en formato serie

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [138]:
titanic_df.index = [str(i) for i in titanic_df.index]

titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [139]:
titanic_df.index[:10]

Index(['0', '1', '2', '3', '4', '5', '6', '7', '8', '9'], dtype='object')

In [140]:
titanic_df.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [141]:
titanic_df.loc[0]

KeyError: 0

In [142]:
titanic_df.loc['0']

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [143]:
titanic_df.index = titanic_df.Name

titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [144]:
titanic_df.iloc[0]    # iloc es por posicion

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: Braund, Mr. Owen Harris, dtype: object

In [145]:
titanic_df.loc[0]    # loc es por nombre

KeyError: 0

In [146]:
titanic_df.loc['Braund, Mr. Owen Harris']    # loc es por nombre

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: Braund, Mr. Owen Harris, dtype: object


**iloc** is used for integer-based indexing in Pandas to access rows

### Specific values

Here's a summary of the different ways to access individual values in a Pandas DataFrame:

1. `df.loc[row_label][column_label]`: Chooses the row with the label and then the value in that row with the column label.

2. `df.iloc[row_position][column_label]`: Selects the row with the position and then the value in that row with the column label.

3. `df.loc[row_label, column_label]`: Directly accesses the value using both row and column labels.

4. `df.iloc[row_position, column_position]`: Directly accesses the value using both row and column positions.

Note: you might see `df[row_label][column_label]`, even though is less recommended that using `loc()`.

In [148]:
titanic_df.iloc[0][3]   # primera fila, cuarta columna

'Braund, Mr. Owen Harris'

In [149]:
titanic_df.iloc[0, 3]

'Braund, Mr. Owen Harris'

In [150]:
titanic_df.loc['Braund, Mr. Owen Harris', 'Age']

22.0

In [151]:
titanic_df.iloc[0:10:2, 3:8:3]  # slicing sobre el indice, slicing sobre las posiciones de columna

,Name,SibSp
Name,,
"Braund, Mr. Owen Harris","Braund, Mr. Owen Harris",1
"Heikkinen, Miss. Laina","Heikkinen, Miss. Laina",0
"Allen, Mr. William Henry","Allen, Mr. William Henry",0
"McCarthy, Mr. Timothy J","McCarthy, Mr. Timothy J",0
"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)","Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",0

In [152]:
titanic_df.loc['Braund, Mr. Owen Harris': 'Allen, Mr. William Henry': 2, 
               'Age': 'Embarked': 2]

                           Age  Parch   Fare Embarked
Name
Braund, Mr. Owen Harris   22.0      0  7.250        S
Heikkinen, Miss. Laina    26.0      0  7.925        S
Allen, Mr. William Henry  35.0      0  8.050        S

In [154]:
titanic_df.index = range(titanic_df.shape[0])

titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [155]:
titanic_df.loc['Braund, Mr. Owen Harris': 'Allen, Mr. William Henry': 2, 
               'Age': 'Embarked': 2]

Empty DataFrame
Columns: [Age, Parch, Fare, Embarked]
Index: []

In [158]:
titanic_df.loc[0: 10: 2, 
               'Age': 'Embarked':2]

     Age  Parch     Fare Embarked
0   22.0      0   7.2500        S
2   26.0      0   7.9250        S
4   35.0      0   8.0500        S
6   54.0      0  51.8625        S
8   27.0      2  11.1333        S
10   4.0      1  16.7000        S

In [161]:
titanic_df.iloc[0: 10: 2,    # slicing sobre filas
                5::2]        # slicing sobre columnas

    Age  Parch     Fare Embarked
0  22.0      0   7.2500        S
2  26.0      0   7.9250        S
4  35.0      0   8.0500        S
6  54.0      0  51.8625        S
8  27.0      2  11.1333        S

In [162]:
titanic_df.iloc[::,    # slicing sobre filas
                5::2]        # slicing sobre columnas

      Age  Parch     Fare Embarked
0    22.0      0   7.2500        S
1    38.0      0  71.2833        C
2    26.0      0   7.9250        S
3    35.0      0  53.1000        S
4    35.0      0   8.0500        S
..    ...    ...      ...      ...
886  27.0      0  13.0000        S
887  19.0      0  30.0000        S
888   NaN      2  23.4500        S
889  26.0      0  30.0000        C
890  32.0      0   7.7500        Q

[891 rows x 4 columns]

In [164]:
titanic_df.loc[0: 10: 2, 'Age': 'Embarked':2] = 90

In [165]:
titanic_df.loc[0: 10: 2, 'Age': 'Embarked':2]

     Age  Parch  Fare Embarked
0   90.0     90  90.0       90
2   90.0     90  90.0       90
4   90.0     90  90.0       90
6   90.0     90  90.0       90
8   90.0     90  90.0       90
10  90.0     90  90.0       90

In [167]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,90.0,1,90,A/5 21171,90.0000,NaN,90
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,90.0,0,90,STON/O2. 3101282,90.0000,NaN,90
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,90.0,0,90,373450,90.0000,NaN,90

In [169]:
titanic_df['PassengerId'] = 'hola'

titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,hola,0,3,"Braund, Mr. Owen Harris",male,90.0,1,90,A/5 21171,90.0000,NaN,90
1,hola,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,hola,1,3,"Heikkinen, Miss. Laina",female,90.0,0,90,STON/O2. 3101282,90.0000,NaN,90
3,hola,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,hola,0,3,"Allen, Mr. William Henry",male,90.0,0,90,373450,90.0000,NaN,90

In [172]:
titanic_df.Cabin.fillna(8, inplace=True)

In [174]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,hola,0,3,"Braund, Mr. Owen Harris",male,90.0,1,90,A/5 21171,90.0000,8,90
1,hola,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,hola,1,3,"Heikkinen, Miss. Laina",female,90.0,0,90,STON/O2. 3101282,90.0000,8,90
3,hola,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,hola,0,3,"Allen, Mr. William Henry",male,90.0,0,90,373450,90.0000,8,90

In [175]:
bool(np.nan)

True

In [177]:
titanic_df.Age.mean()

30.220126050420166

In [178]:
titanic_df.Age.fillna(titanic_df.Age.mean())

0      90.000000
1      38.000000
2      90.000000
3      35.000000
4      90.000000
         ...
886    27.000000
887    19.000000
888    30.220126
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [179]:
titanic_df.Age.median()

28.0


---
## More DataFrame Methods


Let's see some useful methods of the Dataframe class.

### `shape`

`shape` is a Pandas attribute that returns a tuple representing the dimensions of a DataFrame or Series, indicating the number of rows and columns, while `shape()` is not a valid function in Pandas, and attempting to call it will result in an AttributeError.

In [180]:
titanic_df.shape

(891, 12)

### `describe()`

`describe()` is a Pandas method that generates descriptive statistics of a DataFrame, providing information on count, mean, standard deviation, minimum, maximum, and quartiles for each numerical column.

In [182]:
titanic_df.describe().T

          count       mean        std   min     25%      50%     75%       max
Survived  891.0   0.383838   0.486592  0.00   0.000   0.0000   1.000    1.0000
Pclass    891.0   2.308642   0.836071  1.00   2.000   3.0000   3.000    3.0000
Age       714.0  30.220126  15.473847  0.42  20.625  28.0000  39.000   90.0000
SibSp     891.0   0.523008   1.102743  0.00   0.000   0.0000   1.000    8.0000
Parch     891.0   0.984287   7.377447  0.00   0.000   0.0000   0.000   90.0000
Fare      891.0  32.694757  49.884812  0.00   7.925  14.4583  31.275  512.3292

In [194]:
np.percentile(titanic_df.Age.fillna(titanic_df.Age.median()), 50)

28.0

In [196]:
#help(titanic_df.describe)

In [198]:
titanic_df.describe(include='object').T

            count unique                      top freq
PassengerId   891      1                     hola  891
Name          891    891  Braund, Mr. Owen Harris    1
Sex           891      2                     male  577
Ticket        891    681                   347082    7
Cabin         891    148                        8  687
Embarked      889      4                        S  638

### `info()`

`info()` is a Pandas method that provides a concise summary of a DataFrame, including information about the data types, non-null values, and memory usage.

In [200]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    object
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(4), object(6)
memory usage: 83.7+ KB

In [201]:
titanic_df.info(memory_usage='deep')  # informacion de df, metadata

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    object
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(4), object(6)
memory usage: 363.7 KB

### `nunique() and unique()`

`nunique()` is a Pandas function that returns the number of unique elements in a Series or DataFrame, while `unique()` returns an array of unique elements in a Series or DataFrame.

In [202]:
titanic_df.nunique()

PassengerId      1
Survived         2
Pclass           3
Name           891
Sex              2
Age             89
SibSp            7
Parch            8
Ticket         681
Fare           248
Cabin          148
Embarked         4
dtype: int64

In [203]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,hola,0,3,"Braund, Mr. Owen Harris",male,90.0,1,90,A/5 21171,90.0000,8,90
1,hola,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,hola,1,3,"Heikkinen, Miss. Laina",female,90.0,0,90,STON/O2. 3101282,90.0000,8,90
3,hola,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,hola,0,3,"Allen, Mr. William Henry",male,90.0,0,90,373450,90.0000,8,90

In [205]:
titanic_df.drop(index=[0,1,2], inplace=True)

In [207]:
titanic_df.drop(columns=['PassengerId', 'Name'], inplace=True)

In [209]:
titanic_df['nueva'] = 'hola'

In [212]:
titanic_df.nueva2 = 90

In [214]:
titanic_df.nueva2

90

In [216]:
titanic_df.nueva.head()

3    hola
4    hola
5    hola
6    hola
7    hola
Name: nueva, dtype: object

In [218]:
titanic_df.insert(2, 'COLUMNA', 9)

In [220]:
titanic_df.head()

,Survived,Pclass,COLUMNA,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,nueva
3,1,1,9,female,35.0,1,0,113803,53.1000,C123,S,hola
4,0,3,9,male,90.0,0,90,373450,90.0000,8,90,hola
5,0,3,9,male,NaN,0,0,330877,8.4583,8,Q,hola
6,0,1,9,male,90.0,0,90,17463,90.0000,E46,90,hola
7,0,3,9,male,2.0,3,1,349909,21.0750,8,S,hola

In [221]:
titanic_df.unique()

AttributeError: 'DataFrame' object has no attribute 'unique'

In [222]:
titanic_df.Embarked.unique()

array(['S', 90, 'Q', 'C', nan], dtype=object)

In [223]:
titanic_df.value_counts()

Survived  Pclass  COLUMNA  Sex     Age    SibSp  Parch  Ticket             Fare      Cabin    Embarked  nueva
1         1       9        female  24.00  0      0      PC 17477           69.3000   B35      C         hola     2
          3       9        male    32.00  0      0      1601               56.4958   8        S         hola     2
                           female  0.75   2      1      2666               19.2583   8        C         hola     2
0         1       9        female  2.00   1      2      113781             151.5500  C22 C26  S         hola     1
1         1       9        female  39.00  1      1      17421              110.8833  C68      C         hola     1
                                                                                                                ..
0         3       9        male    17.00  0      0      315090             8.6625    8        S         hola     1
                                                        315093             8.6625    8        S         hola     1
                                                        STON/O 2. 3101274  7.1250    8        S         hola     1
                                          1      0      350048             7.0542    8        S         hola     1
1         3       9        male    45.00  0      0      7598               8.0500    8        S         hola     1
Length: 706, dtype: int64

In [224]:
titanic_df.columns

Index(['Survived', 'Pclass', 'COLUMNA', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked', 'nueva'],
      dtype='object')

In [229]:
for c in titanic_df.columns[:3]:
    
    print(c, titanic_df[c].unique())
    print()

Survived [1 0]

Pclass [1 3 2]

COLUMNA [9]

### `dtypes`

`dtypes` is a Pandas attribute that returns the data types of each column in a DataFrame, while `dtype` is a method that returns the data type of a single element in a Series or DataFrame.

In [231]:
titanic_df.dtypes

Survived      int64
Pclass        int64
COLUMNA       int64
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
nueva        object
dtype: object

In [233]:
titanic_df.loc[890, 'Survived'] = 'murio'

In [234]:
titanic_df.tail()

,Survived,Pclass,COLUMNA,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,nueva
886,0,2,9,male,27.0,0,0,211536,13.00,8,S,hola
887,1,1,9,female,19.0,0,0,112053,30.00,B42,S,hola
888,0,3,9,female,NaN,1,2,W./C. 6607,23.45,8,S,hola
889,1,1,9,male,26.0,0,0,111369,30.00,C148,C,hola
890,murio,3,9,male,32.0,0,0,370376,7.75,8,Q,hola

In [235]:
titanic_df.dtypes

Survived     object
Pclass        int64
COLUMNA       int64
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
nueva        object
dtype: object

In [238]:
type(titanic_df.loc[889, 'Survived'])

int

In [240]:
titanic_df.Pclass / 2

3      0.5
4      1.5
5      1.5
6      0.5
7      1.5
      ...
886    1.0
887    0.5
888    1.5
889    0.5
890    1.5
Name: Pclass, Length: 888, dtype: float64

In [242]:
titanic_df.Survived.mean()

TypeError: unsupported operand type(s) for +: 'int' and 'str'

In [244]:
for k,v in titanic_df.Survived.items():
    
    if type(v)==str:
        
        print(k)  # indice donde es string

890

In [250]:
def check(x):
    
    return type(x)==str

In [251]:
list(filter(check, titanic_df.Survived))

['murio']

### `select_dtypes()`

`select_dtypes()` is a pandas function used to filter columns in a DataFrame based on their data types. It allows you to select numeric, object (string), boolean, datetime, or categorical columns.

Syntax:
```python
DataFrame.select_dtypes(include=None, exclude=None)
```

- `include`: A list of data types or strings representing data types to include in the selection. If specified, only columns with these data types will be included.
- `exclude`: A list of data types or strings representing data types to exclude from the selection. If specified, columns with these data types will be excluded.

Example:
```python
# Assuming df is a DataFrame
numeric_columns = df.select_dtypes(include='number')
object_columns = df.select_dtypes(include='object')
```

In [253]:
titanic_df.select_dtypes(include='number').head()

   Pclass  COLUMNA   Age  SibSp  Parch     Fare
3       1        9  35.0      1      0  53.1000
4       3        9  90.0      0     90  90.0000
5       3        9   NaN      0      0   8.4583
6       1        9  90.0      0     90  90.0000
7       3        9   2.0      3      1  21.0750

In [254]:
titanic_df.select_dtypes(exclude='number').head()

  Survived     Sex  Ticket Cabin Embarked nueva
3        1  female  113803  C123        S  hola
4        0    male  373450     8       90  hola
5        0    male  330877     8        Q  hola
6        0    male   17463   E46       90  hola
7        0    male  349909     8        S  hola

In [255]:
titanic_df.select_dtypes(include='object').head()

  Survived     Sex  Ticket Cabin Embarked nueva
3        1  female  113803  C123        S  hola
4        0    male  373450     8       90  hola
5        0    male  330877     8        Q  hola
6        0    male   17463   E46       90  hola
7        0    male  349909     8        S  hola

In [256]:
titanic_df.select_dtypes(include=['object', 'int']).head()

  Survived  Pclass  COLUMNA     Sex  SibSp  Parch  Ticket Cabin Embarked nueva
3        1       1        9  female      1      0  113803  C123        S  hola
4        0       3        9    male      0     90  373450     8       90  hola
5        0       3        9    male      0      0  330877     8        Q  hola
6        0       1        9    male      0     90   17463   E46       90  hola
7        0       3        9    male      3      1  349909     8        S  hola

In [257]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 888 entries, 3 to 890
Data columns (total 12 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  888 non-null    object
 1   Pclass    888 non-null    int64
 2   COLUMNA   888 non-null    int64
 3   Sex       888 non-null    object
 4   Age       711 non-null    float64
 5   SibSp     888 non-null    int64
 6   Parch     888 non-null    int64
 7   Ticket    888 non-null    object
 8   Fare      888 non-null    float64
 9   Cabin     888 non-null    object
 10  Embarked  886 non-null    object
 11  nueva     888 non-null    object
dtypes: float64(2), int64(4), object(6)
memory usage: 83.4+ KB

### Aggregation such as `max()`

In [258]:
titanic_df.max()

/var/folders/95/ms6dwls51ls1jq0t456d3r200000gn/T/ipykernel_13084/1260634145.py:1: FutureWarning: The default value of numeric_only in DataFrame.max is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  titanic_df.max()

Pclass             3
COLUMNA            9
Sex             male
Age             90.0
SibSp              8
Parch             90
Ticket     WE/P 5735
Fare        512.3292
nueva           hola
dtype: object

In [260]:
titanic_df.max(numeric_only=True)

Pclass       3.0000
COLUMNA      9.0000
Age         90.0000
SibSp        8.0000
Parch       90.0000
Fare       512.3292
dtype: float64

In [262]:
titanic_df.mean(numeric_only=True)

Pclass      2.308559
COLUMNA     9.000000
Age        30.041027
SibSp       0.522523
Parch       0.784910
Fare       32.522236
dtype: float64

In [263]:
titanic_df.min(numeric_only=True)

Pclass     1.00
COLUMNA    9.00
Age        0.42
SibSp      0.00
Parch      0.00
Fare       0.00
dtype: float64

In [265]:
titanic_df.to_excel('tablita.xlsx')

In [266]:
titanic_df.to_csv('tablita.csv')

 Just like `max()`, there are many methods that can be applied to either the entire dataframe or its individual columns.

# Summary

- Pandas is a library designed for working with tabulated and tagged data, making it ideal for handling spreadsheets, SQL tables, and more, built on top of NumPy.
- DataFrames and Series are the two main data structures in Pandas.
- Series is a one-dimensional array of data with associated labels called the index, while DataFrame is a two-dimensional tabular data structure with labeled rows and columns.
- Data access in Series and DataFrame can be achieved using integer-based indexing (iloc), label-based indexing (loc), or dictionary-like notation for column access.
- Series and DataFrame have various methods, such as sort_values(), sort_index(), value_counts(), describe(), info(), nunique(), unique(), dtypes, and select_dtypes().

# Extra: Creating Dataframes from a Dictionary

In [268]:
d = {"state": ["Ohio", "Ohio", "California", "Nevada", "California"],
     "year": [2000, 2001, 2002, 2001, 2002],
     "avg": [1.5, 1.7, 3.6, 2.4, 1.9]
}


df = pd.DataFrame(d)

df

        state  year  avg
0        Ohio  2000  1.5
1        Ohio  2001  1.7
2  California  2002  3.6
3      Nevada  2001  2.4
4  California  2002  1.9


DataFrame from a dictionary of lists and indexes

In [269]:
d = {"state": ["Ohio", "Ohio", "California", "Nevada", "California", 'nioje', 'vbkejfnbrei'],
     "year": [2000, 2001, 2002, 2001, 2002],
     "avg": [1.5, 1.7, 3.6, 2.4, 1.9]
}


df = pd.DataFrame(d)

df

ValueError: All arrays must be of the same length

# Extra: pickle

Pandas `pickle` function provides a convenient way to save and load Python objects, including DataFrames, to and from disk. Pickling allows you to serialize Python objects into a binary format, making it easy to store large datasets or complex data structures. It's a great tool for saving and restoring your work, especially when dealing with large datasets that might take a long time to process or recreate.

## Saving DataFrames with Pickle

You can use the `to_pickle()` method in pandas to save a DataFrame to a pickle file. This method takes the file path as an argument and creates a binary representation of the DataFrame, which is then saved to the specified file.

In [271]:
df.to_pickle('data.pkl')

## Loading DataFrames from Pickle

To load a DataFrame from a pickle file, you can use the `read_pickle()` function in pandas. This function reads the binary data from the pickle file and converts it back into a DataFrame.

In [272]:
df = pd.read_pickle('data.pkl')

df

        state  year  avg
0        Ohio  2000  1.5
1        Ohio  2001  1.7
2  California  2002  3.6
3      Nevada  2001  2.4
4  California  2002  1.9